Revit 2027 API
BuiltInFailures.SketchFailures.FloorManyDirectionCurves Property
 More than one span direction curve specified.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FloorManyDirectionCurves { get; }
Public Shared ReadOnly Property FloorManyDirectionCurves As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FloorManyDirectionCurves {
	FailureDefinitionId^ get ();
}
static member FloorManyDirectionCurves : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace